"""
Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб.
"""
print("sadgsfgj")


Capitals = dict()
for i in range (11):
    Capitals[i] =  i**3
    print(Capitals)